### Topics to be coverd

In [1]:
# How to find the Sum, Count, Max, Min and Average 
# How to find unique values and it's counts

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("train.csv")

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# Find the Maximun of age value in Age column
df['Age'].max()

80.0

In [6]:
# Find the Minimun of age value in Age column
df['Age'].min()

0.42

In [7]:
# Find the sum of age value in Age column
df["Age"].sum()

21205.17

In [8]:
# Find the Counts of age value in Age column
df['Age'].count()

714

In [9]:
# Find the Average / Mean of age value in Age column
df['Age'].mean()

29.69911764705882

In [10]:
# Using Numpy method
np.mean(df['Age'])

29.69911764705882

In [11]:
# Find the Unique values value in Age column
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [12]:
df["Sex"].unique()

array(['male', 'female'], dtype=object)

In [13]:
df["Age"].unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [14]:
# Pclass Unique values in the dataset
df["Pclass"].unique()

array([3, 1, 2], dtype=int64)

### Topics to be coverd

In [15]:
# Handling the Missing values

In [16]:
df = pd.read_csv("train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [18]:
df['Age'].isnull().sum()

177

In [19]:
df['Sex'] = df['Sex'].replace('female',np.nan)

In [20]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",NaN,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",NaN,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Topics to be Coverd

In [21]:
# 1.Dropping a single column of the dataset.
# 2.Dropping a multiple column of the dataset.
# 3.Dropping the column of the dataset based on the column index.
# 4.Dropping multiple the column of the dataset based on the column index.
# 5.Deleting the row of the dataset and copying the resultant dataset to a new dataframe.
# 6.Deleting rows based on index.
# 7.Drop the Duplicate values

In [22]:
import numpy as np
import pandas as pd

In [23]:
df = pd.read_csv("train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [24]:
# Drop a single column
df.drop(['Name'],axis = 1,inplace=True)

In [25]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
# Drop a multiple column
df.drop(['Ticket','Fare','Cabin'],axis = 1,inplace=True)

In [27]:
df.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0            1         0       3    male  22.0      1      0        S
1            2         1       1  female  38.0      1      0        C
2            3         1       3  female  26.0      0      0        S
3            4         1       1  female  35.0      1      0        S
4            5         0       3    male  35.0      0      0        S

In [28]:
# Drop a column based on dataset index
df.drop(df.columns[0],axis=1,inplace=True)

In [29]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0         0       3    male  22.0      1      0        S
1         1       1  female  38.0      1      0        C
2         1       3  female  26.0      0      0        S
3         1       1  female  35.0      1      0        S
4         0       3    male  35.0      0      0        S

In [30]:
# Drop a multiple column based on dataset index
rt = df.drop(df.columns[[0,1,2]],axis=1,inplace=True)

In [31]:
df.head()

    Age  SibSp  Parch Embarked
0  22.0      1      0        S
1  38.0      1      0        C
2  26.0      0      0        S
3  35.0      1      0        S
4  35.0      0      0        S

In [33]:
# Drop the duplicated values based on some condition

In [37]:
df[df['Embarked'] != 'C'].head()

    Age  SibSp  Parch Embarked
0  22.0      1      0        S
2  26.0      0      0        S
3  35.0      1      0        S
4  35.0      0      0        S
5   NaN      0      0        Q

In [38]:
dup = df.drop_duplicates().head()

In [39]:
print(dup)

    Age  SibSp  Parch Embarked
0  22.0      1      0        S
1  38.0      1      0        C
2  26.0      0      0        S
3  35.0      1      0        S
4  35.0      0      0        S

In [42]:
dup = df.drop_duplicates(subset=['Embarked'])

In [44]:
print(dup)

     Age  SibSp  Parch Embarked
0   22.0      1      0        S
1   38.0      1      0        C
5    NaN      0      0        Q
61  38.0      0      0      NaN